Tekla Open API Reference for Tekla Structures 2025
ClashChekerEvent.ClashCheckDoneDelegate Delegate
 The delegate to use for clash check completion.
 Namespace: Tekla.Structures.Model.ClashChecker
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ClashCheckDoneDelegate(
	int nClashes
)
Public Delegate Sub ClashCheckDoneDelegate (
	nClashes As Integer
)
Parameters
nClashes
Type: System.Int32
See Also
Reference
Tekla.Structures.Model.ClashChecker Namespace